In [ ]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import LabelEncoder, MinMaxScaler
# minmaxscaler :- it checks the least value in the column and highest value in the column and then it does (Age-minimumAge)/minimumAge - MaximunAge
from sklearn.model_selection import  train_test_split as split
# this used to split the data into training and testing we need this packing
from sklearn.tree import  DecisionTreeClassifier
from sklearn.metrics import accuracy_score
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.linear_model import LogisticRegression

In [ ]:
df = pd.read_csv('titanic.csv')

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
df.isnull().sum()
#tells the null values present in the dataset

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
y = df['Survived']

In [ ]:
df.shape

(891, 12)

In [ ]:
df.drop(['PassengerId', 'Survived', 'Name', 'Cabin', 'Fare', 'Ticket'], axis=1, inplace=True )
# used to delete the unnecessary columns from the dataset

In [ ]:
df.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Embarked'], dtype='object')

In [ ]:
df.head()

   Pclass     Sex   Age  SibSp  Parch Embarked
0       3    male  22.0      1      0        S
1       1  female  38.0      1      0        C
2       3  female  26.0      0      0        S
3       1  female  35.0      1      0        S
4       3    male  35.0      0      0        S

In [ ]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
#this command is used to replacethe null values with the mean of the age
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
# This command is used to fill the null values with most repeated name in the column

In [ ]:
df.head()

   Pclass     Sex   Age  SibSp  Parch Embarked
0       3    male  22.0      1      0        S
1       1  female  38.0      1      0        C
2       3  female  26.0      0      0        S
3       1  female  35.0      1      0        S
4       3    male  35.0      0      0        S

In [ ]:
df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Embarked    0
dtype: int64

In [ ]:
le = LabelEncoder()

In [ ]:
df['Sex'] = le.fit_transform(df['Sex'])
# It can also be used to transform non-numerical labels (as long as they are hashable and comparable) to numerical labels.

In [ ]:
df['Embarked'] = le.fit_transform(df['Embarked'])
# It can also be used to transform non-numerical labels (as long as they are hashable and comparable) to numerical labels.

In [ ]:
df.head()

   Pclass  Sex   Age  SibSp  Parch  Embarked
0       3    1  22.0      1      0         2
1       1    0  38.0      1      0         0
2       3    0  26.0      0      0         2
3       1    0  35.0      1      0         2
4       3    1  35.0      0      0         2

In [ ]:
df['Total Family Members'] = df['SibSp']+df['Parch']+1

In [ ]:
df.head()

   Pclass  Sex   Age  SibSp  Parch  Embarked  Total Family Members
0       3    1  22.0      1      0         2                     2
1       1    0  38.0      1      0         0                     2
2       3    0  26.0      0      0         2                     1
3       1    0  35.0      1      0         2                     2
4       3    1  35.0      0      0         2                     1

In [ ]:
df.drop(['SibSp', 'Parch'], axis=1, inplace=True)

In [ ]:
df.head()

   Pclass  Sex   Age  Embarked  Total Family Members
0       3    1  22.0         2                     2
1       1    0  38.0         0                     2
2       3    0  26.0         2                     1
3       1    0  35.0         2                     2
4       3    1  35.0         2                     1

In [ ]:
mms = MinMaxScaler()

In [ ]:
df['Age'] = mms.fit_transform(df[['Age']])

In [ ]:
df.head()

   Pclass  Sex       Age  Embarked  Total Family Members
0       3    1  0.271174         2                     2
1       1    0  0.472229         0                     2
2       3    0  0.321438         2                     1
3       1    0  0.434531         2                     2
4       3    1  0.434531         2                     1

In [ ]:
x = df.values

In [ ]:
x

array([[3.        , 1.        , 0.27117366, 2.        , 2.        ],
       [1.        , 0.        , 0.4722292 , 0.        , 2.        ],
       [3.        , 0.        , 0.32143755, 2.        , 1.        ],
       ...,
       [3.        , 0.        , 0.36792055, 2.        , 4.        ],
       [1.        , 1.        , 0.32143755, 0.        , 1.        ],
       [3.        , 1.        , 0.39683338, 1.        , 1.        ]])

In [ ]:
xtr, xte, ytr, yte = split(x, y, test_size=0.2, random_state=0)

In [ ]:
dtc = DecisionTreeClassifier()

In [ ]:
dtc.fit(xtr, ytr)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [ ]:
dt_prediction = dtc.predict(xte)

In [ ]:
dtc_acc = accuracy_score(yte, dt_prediction)

In [ ]:
print(dtc_acc)

0.8156424581005587

In [ ]:
rfc = RandomForestClassifier(n_estimators=1000)

In [ ]:
rfc.fit(xtr, ytr)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [ ]:
rfc_prediction = rfc.predict(xte)

In [ ]:
rfc_acc = accuracy_score(yte, rfc_prediction)

In [ ]:
print(rfc_acc)

0.8156424581005587

In [ ]:
knc = KNeighborsClassifier()

In [ ]:
knc.fit(xtr, ytr)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=5, p=2,
                     weights='uniform')

In [ ]:
knc_prediction = knc.predict(xte)

In [ ]:
knc_acc = accuracy_score(yte, knc_prediction)

In [ ]:
print(knc_acc)

0.7932960893854749

In [ ]:
lr = LogisticRegression()

In [ ]:
lr.fit(xtr,ytr)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
lr_prediction = lr.predict(xte)

In [ ]:
lr_acc = accuracy_score(yte, lr_prediction)

In [ ]:
print(lr_acc)

0.7988826815642458